package _4_for_loop;

public class _01_NumbersFrom1To100 {

    public static void main(String[] args) {

        // начало: 1
        // край: 100
        // промяна: 1( 1 е стъпката с която ще увеличаваме нашата приоменлива, стъпката с която ще се движим)

        for (int number = 1; number <= 100; number++){
            System.out.println(number);
        }

        // Да използвам debug

        // И виждате ли колко са полезни тези for цикли. Утре вашият шеф може да дойде и да ви каже
        // да напишете една програма която отпечатва числата от 1 до 20 и вие може да кажете аз ще
        // ги изпринтирам със System.out.println, но ако дойде след една седмица и ви каже да ги
        // изпринтирате 1 000 000 пъти, вие янам дапишете един милион пъти System.out.println, а просто
        // ще промените да не е до 100, а да е до 1 000 000

    }
}
