package _4_for_loop;

import java.util.Scanner;

public class
_04_EvenPowersOf2 {

    public static void main(String[] args) {

        // На нас ни се дава едно число от конзолата
        // И трябва да завъртим цикъл от 0 до прочетеното число от
        // конзолата и да вземем само четните числа от 0 до n и
        // ако числото е четно го използваме като степен

        Scanner scanner = new Scanner(System.in);
        int n = Integer.parseInt(scanner.nextLine());

        // Четни степени на 2 - от 0 до n

        // начало: 0 (началото е 0, защото 0 е валидна степен)
        // край: n
        // промяна: тук промяната може да се случва по два начина
        // ние можем да се движим с 1 нагоре и да проверяваме всеки път с if
        // проверка, ако сегашното число е четно, искам с тов число да вдигна
        // двойката на степен
        // обаче, как можем да я решим по друг начин
        // от 0 до n ние трябва да вземаме само четните числа, т.е. може да
        // използваме нещо като малък хак и да увеличаваме с 2 и така може
        // да изпуснем if проверката
        for (int step = 0; step <= n; step++) {
            if (step % 2 == 0 ){
                System.out.println(Math.pow(2, step));
            }
        }

//        for (int step = 0; step <= n; step += 2) {
//            // поу - pow, идва от power и ние го използваме за да вдигнем
//            // някакво число нан степен
//            System.out.println(Math.pow(2, step));
//        }

    }
}
