package _3_conditional_statements_advanced;

import java.util.Scanner;

public class _1_DayOfWeek {

    public static void main(String[] args) {

        // scan - да си направя и scan template за скенер
        // Ще ни трябва и един скенер, за да прочитаме и данните които ни се въвеждат от конзолата
        Scanner scanner = new Scanner(System.in);

        // В задачата ни казват че трябва да четем цяло число
        // За целта си създавам променлива от тип цяло число
        // зада може след като го прочета да го запиша в нея
        // казвам че искам първият ред който се въведе в конзолата
        // да ми се съхрани в това число number
        int number = Integer.parseInt(scanner.nextLine());

        // Сега ние тук виждаме че за нашата променлива number
        // ние искаме да направим няколко проверки.
        // първо искам да проверя дали number e равно на 1
        // и да си отпечатам текста Monday
        // после...

        // И сега, това го запомнете, когато искате да направите серия от проверки
        // и то серия от проверки за точни стойности, се използва SWITCH конструкцията.

        // А какво ще рече серия от проверки за точни стойности? Ами аз искам да проверя number
        // да ли е равно на 1, после на 2, т.н.

        // Т.е. в SWITCH конструкцията не можем да проверяваме дали стойноста е по-малка от 1
        // или от 10 или от 100, имайте го предвид.

        // Сега, как се изписва тази switch конструкция. Как се изгражда тази switch конструкция
        // Първо си записваме ключовата дума  switch


        // number == 1 -> Monday
        // number == 2 -> Tuesday
        // 3 -> Wednesday
        // Thursday
        // Friday
        // Saturday
        // Sunday




        // вътре в скобите, слагаме променливата за която искаме да направим тази серия от проверки
        // следователно вътре ще си сложа променливата number
        // switch case може да проверява само точни стойности, не може да проверява дали е < от нещо
        // ЗА МЕН - да поставя мишката на switch и да покажа, че може да се напише и със серия от проверки if-else
        switch (number) {
            // къдрави скоби в които си записваме логиката на нашата switch конструкция

            // първото нещо което искам да проверя, е дали number е равно на 1
            // как става това, ами казваме, в случай, че number стане равбо на 1, изпълни всичко
            // в двоеточието, или да го кажа по-правилно, между двоеточието и бреак-а
            // Да обясня ако няма break какво ще се случи когато срещнем условие което върне TRUE,
            // ще се изпълнят всички условия по-надолу
            // Т.е. switch case е заместител на if-else,if-else
            // t.e. switch case, е малко по-слаб, защото той може да проверява само
            // за точни стойности
            // Казахем какви са предимствата и разликите, вече вие ще си изберете
            // коя конструкция да използвате
            // Хубаво е да знаете как работи switch case i как работи серията от проверки
            // if-else/if else
            case 1:
                System.out.println("Monday");
                break; // break e оператор, който прекратява switch case конструкцията

            // След това какво си казвам, ами казвам си че искам да направя втората проверка
            // Дали number e равно на 2
            case 2:
                System.out.println("Tuesday");
                break;
            case 3:
                System.out.println("Wednesday");
                break;
            case 4:
                System.out.println("Thursday");
                break;
            case 5:
                System.out.println("Friday");
                break;
            case 6:
                System.out.println("Saturday");
                break;
            case 7:
                System.out.println("Sunday");
                break;
            // Обходихме всички случай. Но има още един случай и той е
            // че ако number е различно от числата от 1 до 7
            // Ако number е число, от 1 до 7, ясно какво се случва, но ако не е
            // какво ще се случи според вас?
            // Ами няма да влезе в нито една от прверките
            // Switch case конструкцита има едно нещо което се нарича default,
            // какво означава това, това означава че ако не влезе никъде в нито един
            // case накрая ще се изпълни default кейс-а
            default:
                System.out.println("Error");
                break;

            // Обяснвам step by step, как работи switch case
            // като въведа число от конзолата

        }

    }
}
