package _3_conditional_statements_advanced;

import java.util.Scanner;

public class _4_PersonalTitles {

    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        double age = Double.parseDouble(scanner.nextLine());
        String gender = scanner.nextLine();

        // да разчертая на един бял лист като дървовидна структура
        // gender - > мъж, жена, те също имат по два варианта
        // мъж ->
        // жена ->

        // 1. Проверка за пол-а
        if (gender.equals("m")){
            // мъж
            // проверка за възрастта
            if (age >= 16){
                System.out.println("Mr.");
            } else {
                System.out.println("Master");
            }

        } else if (gender.equals("f")) {
            // жена
            // проверка за възрастта
            if (age >= 16){
                System.out.println("Ms.");
            } else {
                System.out.println("Miss");
            }
        }

        // Нека да я дебъгнем. Сега първото нещо което трябва да направим когато дебъгваме е
        // да дефинираме къде ще си сложим нашият бреак поинт, т.е. от къде ще започваме
        // нашият процес по дебъгване
        // От къде ще започне нашият процес на дебъгване, ами нека да започне от if
        // конструкцията, защоото от тук на горе, аз нямам какво да дебъгвам
        // За да започне нашият процес по дебъгване , ние трябва да изпълним всичко до нашият
        // бреак поинт. Скенерът вече се е създал
        // трябва да си въведа стоиност за променлива та age
        // и трябва да си въведа стоиност за променливата gender
        // Изпълнили сме всичко до бреак поинт-а и виждате как задачата спря своето изпълнение
        // на него. Свети редът който предстои да се изпълне

    }
}
